from dao import customer

Customer = customer.CustomerListInit()
CustomerQuery = customer.CustomerQueryInit("")


def customer_query_init():
    CustomerQuery.Set("别名列表", True)
    inner = CustomerQuery.Group("", "发送“角色 {角色名/角色别名}”以查看角色信息")
    inner.Set("别名", True)


def customer_init():
    Customer.Set_Customer("莉格露", {
        "name": "莉格露",
        "other_name": ["莉格露", "lgl", "虫子", "萤火虫"],
        "like_food_tag": ["肉", "甜", "生", "猎奇"],
        "unlike_food_tag": ["素", "清淡", "凉爽"],
        "like_drink_tag": ["低酒精", "可加冰"],
        "place": "|妖兽怪道|魔法森林|",
        "s_card": "灯符『荧光现象』:顾客出现速度+30%，持续30秒",
        "f_card": "蠢符『夜虫龙卷』:赶走所有客人且不结账",
        "money": "200~400円",
        "food": ["露水煮蛋", "香炸蝉蜕", "幻昙华糕"],
    })
    Customer.Set_Customer("露米娅", {
        "name": "露米娅",
        "other_name": ["露米娅", "lmy", "10", "⑩"],
        "like_food_tag": ["肉", "招牌", "生", "猎奇", "饱腹", "流行·喜爱"],
        "unlike_food_tag": ["昂贵", "下酒", "流行·厌恶"],
        "like_drink_tag": ["苦", "气泡"],
        "place": "|妖兽怪道|魔法森林|",
        "s_card": "月符『月光射线』:随机获得图鉴中收录的3种肉类",
        "f_card": "暗符『境界线』:黑暗笼罩你的料理区域，持续20s",
        "money": "150~350円",
        "food": ["臭豆腐", "炸八目鳗", "赛熊掌"],
    })
    Customer.Set_Customer("橙", {
        "name": "橙",
        "other_name": ["橙", "cheng"],
        "like_food_tag": ["肉", "水产", "甜", "烧烤", "重油", "流行·喜爱"],
        "unlike_food_tag": ["素", "猎奇", "灼热", "流行·厌恶"],
        "like_drink_tag": ["辛", "水果"],
        "place": "|妖兽怪道|",
        "s_card": "仙符『凤凰卵』:随机获得三种鱼类食材",
        "f_card": "方符『奇门遁甲』:降低客人的入店频率",
        "money": "400~600円",
        "food": ["秘制小鱼干", "猪肉鳟鱼熏", "力量汤"],
    })
    Customer.Set_Customer("稗田阿求", {
        "name": "稗田阿求",
        "other_name": ["稗田阿求", "阿求", "aq", "阿q"],
        "like_food_tag": ["文化底蕴", "和风", "甜", "汤羹", "清淡", "高级", "流行·喜爱"],
        "unlike_food_tag": ["灼热", "重油", "咸", "流行·厌恶"],
        "like_drink_tag": ["清酒", "可加热"],
        "place": "|人间之里|",
        "s_card": "撰书『这也全都是妖怪干的吗』:获得一张签名色纸",
        "f_card": "口授『黑心店家的黑心历史』:清空店内气氛，降低正在用餐客人的心情值",
        "money": "500~800円",
        "food": ["豆腐味噌", "蔬菜专辑", "樱落雪"],
    })
    Customer.Set_Customer("上白泽慧音", {
        "name": "上白泽慧音",
        "other_name": ["上白泽慧音", "hy", "慧音", "老师"],
        "like_food_tag": ["文化底蕴", "和风", "中华", "家常", "清淡", "素", "流行·喜爱"],
        "unlike_food_tag": ["重油", "大份", "咸", "流行·厌恶"],
        "like_drink_tag": ["清酒", "烧酒", "利口酒"],
        "place": "|人间之里|",
        "s_card": ("国符『三种神器』:从以下四件神器中随机选择一种\n"
                   "  ○ 剑：随机奖励两种蔬菜\n"
                   "  ○ 镜：在一定时间内烹饪不消耗食材\n"
                   "  ○ 玉：随机解锁一个未完全解锁的稀客信息\n"
                   "  ○ 乡：吸引大量普客前来就餐"),
        "f_card": "国符『秘笈·头槌』:眩晕20s，期间无法移动。可以通过乱打方向键恢复",
        "money": "400~800円",
        "food": ["油豆腐", "诗礼银杏", "白雪"],
    })
    Customer.Set_Customer("茨木华扇", {
        "name": "茨木华扇",
        "other_name": ["茨木华扇", "华扇", "hs"],
        "like_food_tag": ["文化底蕴", "和风", "家常", "下酒"],
        "unlike_food_tag": ["实惠", "生", "辣"],
        "like_drink_tag": ["中酒精", "直饮", "古典"],
        "place": "|人间之里|",
        "s_card": "『猛兽的艺术用法』:召唤宠物老虎在店内演出，让排队和就座的客人每隔一段时间就会随机打赏1-30円",
        "f_card": "『断善修恶的禁欲考验』:客人只会点最便宜的食物和绿茶，持续30s",
        "money": "400~600円",
        "food": ["豆腐锅", "牛肉盖浇饭", "野味加农"],
    })
    Customer.Set_Customer("博丽灵梦", {
        "name": "博丽灵梦",
        "other_name": ["博丽灵梦", "灵梦", "lm", "城管"],
        "like_food_tag": ["实惠", "不可思议", "甜", "饱腹", "高级", "流行·喜爱"],
        "unlike_food_tag": ["昂贵", "下酒", "流行·厌恶"],
        "like_drink_tag": ["低酒精", "无酒精", "可加热"],
        "place": "|妖兽怪道|人间之里|博丽神社|妖怪之山|魔法森林|",
        "s_card": "梦符『二重结界』:获得一次可以完全防御稀客惩罚符卡的BUFF",
        "f_card": "灵符『梦想封印』:随机封印菜单上的三种菜品，无法制作。持续30s",
        "money": "150~300円",
        "food": ["温暖饭团", "杂炊", "大奢宴"],
    })
    Customer.Set_Customer("伊吹萃香", {
        "name": "伊吹萃香",
        "other_name": ["伊吹萃香", "萃香", "cx", "西瓜"],
        "like_food_tag": ["肉", "下酒", "小巧", "力量涌现", "和风", "流行·喜爱"],
        "unlike_food_tag": ["重油", "流行·厌恶"],
        "like_drink_tag": ["高酒精", "直饮"],
        "place": "|博丽神社|妖怪之山|",
        "s_card": "酒吞奥义『鬼进酒:赠送一瓶名贵酒水(价值60+)",
        "f_card": "『百万鬼夜行』:偷走三瓶名贵酒水",
        "money": "600~800円",
        "food": ["炸猪排", "能力串", "二天一流"],
    })
    Customer.Set_Customer("比那名居天子", {
        "name": "比那名居天子",
        "other_name": ["比那名居天子", "天子", "tz"],
        "like_food_tag": ["适合拍照", "昂贵", "下酒", "甜", "素", "清淡", "传说", "流行·厌恶"],
        "unlike_food_tag": ["重油", "重油", "家常", "流行·喜爱"],
        "like_drink_tag": ["高酒精", "鸡尾酒"],
        "place": "|博丽神社|妖怪之山|旧地狱|",
        "s_card": "『全人类的绯想天』:全部正在就餐的顾客心情提高至85%",
        "f_card": "『天罚的石柱』:天降要石摧毁2个座位，赶走该桌上的客人，期间座位无法使用，持续60s",
        "money": "2000~3000円",
        "food": ["凉菜雕花", "桃花羹", "北极甜虾蜜桃色拉"],
    })
    Customer.Set_Customer("红美铃", {
        "name": "红美玲",
        "other_name": ["红美玲", "hml", "红师傅"],
        "like_food_tag": ["肉", "饱腹", "中华", "力量涌现", "流行·喜爱"],
        "unlike_food_tag": ["猎奇", "果味", "西式", "流行·厌恶"],
        "like_drink_tag": ["古典", "提神", "可加热"],
        "place": "|红魔馆|",
        "s_card": "华符『芳华绚烂』:每2秒增加店内气氛1点，持续60s",
        "f_card": "『N〇ver say no to p〇nda』:随机摧毁一个桌椅，赶走该桌上正在用餐的客人，并且降低10点气氛，坏的座位90s内无法使用",
        "money": "200~400円",
        "food": ["红烧鳗鱼", "白果萝卜排骨汤", "华光玉煎包"],
    })
    Customer.Set_Customer("帕秋莉", {
        "name": "帕秋莉",
        "other_name": ["帕秋莉", "帕琪", "pq", "pql", "姆q", "宅女"],
        "like_food_tag": ["适合拍照", "梦幻", "高级", "甜", "西式"],
        "unlike_food_tag": ["猎奇", "生", "灼热", "咸"],
        "like_drink_tag": ["利口酒", "鸡尾酒", "气泡"],
        "place": "|红魔馆|地灵殿|",
        "s_card": "知识的奇妙冒险『文化之风』:含有文化底蕴TAG的料理，必定获得最高评价，持续20s",
        "f_card": "金水符『水银之毒』:接下来制作的料理，有50%概率变成黑暗物质。持续30s",
        "money": "600~1000円",
        "food": ["班尼迪克蛋鱼", "意式烩饭", "惠灵顿牛排"],
    })
    Customer.Set_Customer("琪露诺", {
        "name": "琪露诺",
        "other_name": ["琪露诺", "baka", "qln", "9", "⑨", "笨蛋"],
        "like_food_tag": ["适合拍照", "凉爽", "猎奇", "甜", "流行·厌恶"],
        "unlike_food_tag": ["昂贵", "文化底蕴", "下酒", "流行·喜爱"],
        "like_drink_tag": ["水果", "可加冰", "甘"],
        "place": "|红魔馆|妖怪之山|",
        "s_card": "『甜美的冰霜小妖精』:随机获得3种带有可加冰TAG的酒水，并且获得2-5枚冰块",
        "f_card": "冻符『完美冻结』:随机冻住3个厨具，该厨具中正在制作的菜直接消失，持续30s",
        "money": "100~200円",
        "food": ["真·海鲜味噌汤", "刺身拼盘", "猪鹿蝶"],
    })
    Customer.Set_Customer("藤原妹红", {
        "name": "藤原妹红",
        "other_name": ["藤原妹红", "妹红", "mh", "爷们红"],
        "like_food_tag": ["灼热", "辣", "果味", "燃起来了"],
        "unlike_food_tag": ["昂贵", "高级", "不可思议"],
        "like_drink_tag": ["烧酒", "辛", "苦"],
        "place": "|迷途竹林|",
        "s_card": "不死『火鸟 凤翼天翔』:所有厨具的料理速度增加50%，持续30s",
        "f_card": "藤原『灭罪寺院伤』:无论多好的料理，最高也只能获得普通评价，持续30s",
        "money": "300~600円",
        "food": ["麻婆豆腐", "水煮鱼", "岩浆"],
    })
    Customer.Set_Customer("蓬莱山辉夜", {
        "name": "蓬莱山辉夜",
        "other_name": ["蓬莱山辉夜", "辉夜", "hy", "竹取姬"],
        "like_food_tag": ["和风", "传说", "文化底蕴", "不可思议", "流行·喜爱"],
        "unlike_food_tag": ["大份", "招牌", "猎奇", "流行·厌恶"],
        "like_drink_tag": ["清酒", "古典", "现代"],
        "place": "|迷途竹林|",
        "s_card": "『永夜归返 世间开明』:增加营业时间30分钟，即现实30秒",
        "f_card": "神宝『蓬莱的玉枝 梦色之乡』:减少营业时间30分钟，即现实30秒。如果到营业结束时间会强制结束营业",
        "money": "1000~1500円",
        "food": ["竹笋蒸蛋", "月之恋人", "蓬莱玉枝"],
    })
    Customer.Set_Customer("因幡帝", {
        "name": "因幡帝",
        "other_name": ["因幡帝", "帝", "d", "兔子", "小牢帝"],
        "like_food_tag": ["甜", "小巧", "凉爽", "传说", "梦幻", "流行·喜爱"],
        "unlike_food_tag": ["猎奇", "重油", "山珍", "流行·厌恶"],
        "like_drink_tag": ["无酒精", "甘", "水果"],
        "place": "|迷途竹林|",
        "s_card": "生机『四十叶草般的幸运』:刷新所有采集点，并且获得一片神奇的四叶草，第二天所有采集点及委托采集的物品额外产出1~2个，仅次日生效",
        "f_card": ("想起『那年的素兔的恐怖』:开启强买强卖模式(该符卡不会被二重结界抵挡)\n"
                   "  ○ 噩耗『Combo消失术』:中断目前的Combo，并且在30s内无法获得Combo"),
        "money": "200~400円",
        "food": ["麻薯", "白桃生八桥", "月光团子"],
    })
    Customer.Set_Customer("森近霖之助", {
        "name": "森近霖之助",
        "other_name": ["森近霖之助", "香霖", "lzz", "霖之助", "乡长"],
        "like_food_tag": ["家常", "饱腹", "鲜", "流行·喜爱"],
        "unlike_food_tag": ["下酒", "猎奇", "重油", "流行·厌恶"],
        "like_drink_tag": ["啤酒", "烧酒"],
        "place": "|人间之里|魔法森林|",
        "s_card": "『欢迎来到香霖堂』:『香霖堂购物节』，获得一张香霖堂商品价格-30％的打折券，有效期为次日当天",
        "f_card": "『虚构的情报』:随机隐藏一个稀客的TAG，不会隐藏五级羁绊稀客的TAG",
        "money": "250~400円",
        "food": [],
    })
    Customer.Set_Customer("雾雨魔理沙", {
        "name": "雾雨魔理沙",
        "other_name": ["雾雨魔理沙", "魔理沙", "mls", "金发女孩"],
        "like_food_tag": ["和风", "菌类", "传说", "重油", "灼热", "流行·喜爱"],
        "unlike_food_tag": ["猎奇", "流行·厌恶"],
        "like_drink_tag": ["低酒精", "可加冰"],
        "place": "所有地区",
        "s_card": "流星『超级英仙座』:给予随机三个可以重复的菌类TAG食材",
        "f_card": "魔符『拿来吧你』:随机窃取两个料理/食材/酒水",
        "money": "3000~5000円",
        "food": ["蘑菇肉片", "秘制鲜菌煲", "蘑女的舞踏烩"],
    })
    Customer.Set_Customer("魂魄妖梦", {
        "name": "魂魄妖梦",
        "other_name": ["魂魄妖梦", "妖梦", "ym", "u梦"],
        "like_food_tag": ["鲜", "家常", "清淡", "力量涌现"],
        "unlike_food_tag": ["重油", "猎奇", "咸"],
        "like_drink_tag": ["可加热", "水果", "无酒精"],
        "place": "|妖怪兽道|人间之里|博丽神社|迷途竹林|",
        "s_card": "狱界剑『二百由甸之一闪』:使用料理台制作料理能瞬间完成。持续60s",
        "f_card": "天上剑『天人之五衰』:客人失去耐心速度×2，每秒钟气氛值-2。持续60",
        "money": "300~400円",
        "food": [],
    })
    Customer.Set_Customer("西行寺幽幽子", {
        "name": "西行寺幽幽子",
        "other_name": ["西行寺幽幽子", "幽幽子", "uuz"],
        "like_food_tag": ["肉", "饱腹", "大份", "水产", "和风", "中华", "高级", "传说"],
        "unlike_food_tag": ["素", "小巧", "清淡"],
        "like_drink_tag": ["高酒精", "可加冰", "鸡尾酒"],
        "place": "|博丽神社|红魔馆|迷途竹林|",
        "s_card": "『食物瞬间消失术』:客人会瞬间吃完料理，持续到营业结束",
        "f_card": "『加料加量不加价』:所有没有“大份”TAG的料理都会收到差评，持续到营业结束",
        "money": "1300~1800円",
        "food": [],
    })


def customer_server_init():
    customer_query_init()
    customer_init()
